Repository: selfcan/StrokeMouse
Catalog: StrokeMouse/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ja, ko, ru, zh_hans, zh_hant

# permissions.failure.multitouchFramework
source: Private framework unavailable
fr: Framework privé indisponible
ja: 非公開フレームワークを利用できません
ko: 비공개 프레임워크를 사용할 수 없음
ru: Закрытый фреймворк недоступен
zh_hans: 私有框架不可用
zh_hant: 私有框架不可用

# permissions.failure.multitouchSymbol
source: Private API changed
fr: API privée modifiée
ja: 非公開APIが変更されています
ko: 비공개 API가 변경됨
ru: Закрытый API изменился
zh_hans: 私有 API 已变化
zh_hant: 私有 API 已變化

# permissions.failure.multitouchDevice
source: No trackpad device
fr: Aucun trackpad détecté
ja: トラックパッドデバイスがありません
ko: 트랙패드 기기 없음
ru: Нет устройства трекпада
zh_hans: 未找到触控板设备
zh_hant: 未找到觸控式軌跡板裝置

# permissions.failure.multitouchDimensions
source: Invalid trackpad dimensions
fr: Dimensions du trackpad non valides
ja: トラックパッドのサイズが無効です
ko: 트랙패드 크기가 올바르지 않음
ru: Недопустимые размеры трекпада
zh_hans: 触控板尺寸异常
zh_hant: 觸控式軌跡板尺寸異常

# permissions.failure.multitouchFrame
source: Invalid touch frame
fr: Trame tactile non valide
ja: タッチフレームが無効です
ko: 터치 프레임이 올바르지 않음
ru: Недопустимый кадр касаний
zh_hans: 触点帧异常
zh_hant: 觸點幀異常

# permissions.failure.multitouchStart
source: Trackpad channel failed to start
fr: Échec du démarrage du canal trackpad
ja: トラックパッドチャネルを開始できませんでした
ko: 트랙패드 채널을 시작하지 못함
ru: Не удалось запустить канал трекпада
zh_hans: 触控通道启动失败
zh_hant: 觸控通道啟動失敗

# permissions.configRecovery
source: Configuration Recovery
fr: Récupération de la configuration
ja: 設定の復元
ko: 구성 복구
ru: Восстановление конфигурации
zh_hans: 配置恢复
zh_hant: 配置恢復

# permissions.revealConfig
source: Reveal Configuration File
fr: Afficher le fichier de configuration
ja: 設定ファイルをFinderに表示
ko: 구성 파일 보기
ru: Показать файл конфигурации в Finder
zh_hans: 在访达中显示配置文件
zh_hant: 在訪達中顯示配置檔案

# gestureTest.diagnosticsActive
source: Diagnostics: actions disabled
fr: Diagnostic : actions désactivées
ja: 診断: アクションは無効
ko: 진단: 동작이 비활성화됨
ru: Диагностика: действия отключены
zh_hans: 诊断模式：动作已禁用
zh_hant: 診斷模式：動作已禁用

# gestureTest.inputMode
source: Test Input
fr: Entrée de test
ja: テスト入力
ko: 테스트 입력
ru: Тестовый ввод
zh_hans: 测试输入
zh_hant: 測試輸入

# gestureTest.input.mouseDraw
source: Mouse Draw
fr: Dessin souris
ja: マウス描画
ko: 마우스 그리기
ru: Рисование мышью
zh_hans: 鼠标绘制
zh_hant: 滑鼠繪製

# gestureTest.input.modifierDraw
source: Trackpad Draw
fr: Dessin trackpad
ja: トラックパッド描画
ko: 트랙패드 그리기
ru: Рисование на трекпаде
zh_hans: 触控板绘制
zh_hant: 觸控式軌跡板繪製

# gestureTest.input.directTrackpad
source: Touch Gestures
fr: Gestes tactiles
ja: タッチジェスチャ
ko: 터치 제스처
ru: Сенсорные жесты
zh_hans: 触控手势
zh_hant: 觸控手勢

# gestureTest.modifierInstruction
source: Hold exactly one modifier and move the pointer to test trackpad draw.
fr: Maintenez exactement une touche de modification et déplacez le pointeur pour tester le dessin trackpad.
ja: 修飾キーを1つだけ押しながらポインタを動かして、トラックパッド描画をテストします。
ko: 보조 키 하나만 정확히 누른 채 포인터를 움직여 트랙패드 그리기를 테스트하세요.
ru: Удерживайте ровно одну клавишу-модификатор и перемещайте указатель, чтобы проверить рисование на трекпаде.
zh_hans: 按住一个修饰键并移动指针，测试触控板绘制。
zh_hant: 按住一個修飾鍵並移動指標，測試觸控式軌跡板繪製。

# gestureTest.directInstruction
source: Use the physical trackpad to test multi-finger recognition.
fr: Utilisez le trackpad physique pour tester la reconnaissance multi-doigts.
ja: 実際のトラックパッドで多指認識をテストします。
ko: 실제 트랙패드로 여러 손가락 인식을 테스트하세요.
ru: Используйте физический трекпад, чтобы проверить распознавание нескольких пальцев.
zh_hans: 使用真实触控板测试多指识别。
zh_hant: 使用真實觸控式軌跡板測試多指識別。

# gestureTest.trackpadDrawCanvas
source: Trackpad Draw Path
fr: Tracé du dessin trackpad
ja: トラックパッド描画の軌跡
ko: 트랙패드 그리기 경로
ru: Траектория рисования на трекпаде
zh_hans: 触控板绘制轨迹
zh_hant: 觸控式軌跡板繪製軌跡

# gestureTest.trackpadDrawWaiting
source: Hold a modifier and move the pointer to draw a test path.
fr: Maintenez une touche de modification et déplacez le pointeur pour dessiner un tracé de test.
ja: 修飾キーを押しながらポインタを動かして、テスト軌跡を描きます。
ko: 보조 키를 누른 채 포인터를 움직여 테스트 경로를 그리세요.
ru: Удерживайте модификатор и перемещайте указатель, чтобы нарисовать тестовую траекторию.
zh_hans: 按住修饰键并移动指针，绘制测试轨迹。
zh_hant: 按住修飾鍵並移動指標，繪製測試軌跡。

# gestureTest.trackpadDrawSource
source: %@ is the active modifier
fr: %@ est la touche de modification active
ja: %@が現在の修飾キーです
ko: 현재 보조 키는 %@
ru: %@ — активный модификатор
zh_hans: %@为当前修饰键
zh_hant: %@為當前修飾鍵

# gestureTest.trackpadTitle
source: Trackpad Diagnostics
fr: Diagnostic du trackpad
ja: トラックパッド診断
ko: 트랙패드 진단
ru: Диагностика трекпада
zh_hans: 触控板诊断
zh_hant: 觸控式軌跡板診斷

# gestureTest.trackpadMetrics
source: %d fingers Δ(%.3f, %.3f) scale %.2f rotation %.1f°
fr: %d doigts Δ(%.3f, %.3f) échelle %.2f rotation %.1f°
ja: %d本指 変位(%.3f, %.3f) 拡大縮小 %.2f 回転 %.1f°
ko: %d손가락 Δ(%.3f, %.3f) 배율 %.2f 회전 %.1f°
ru: %d пальцев Δ(%.3f, %.3f) масштаб %.2f поворот %.1f°
zh_hans: %d 指 位移(%.3f, %.3f) 缩放 %.2f 旋转 %.1f°
zh_hant: %d 指 位移(%.3f, %.3f) 縮放 %.2f 旋轉 %.1f°

# gestureTest.trackpadWaiting
source: Touch the trackpad to inspect recognition.
fr: Touchez le trackpad pour examiner la reconnaissance.
ja: トラックパッドに触れて認識結果を確認します。
ko: 트랙패드를 터치하여 인식을 확인하세요.
ru: Коснитесь трекпада, чтобы проверить распознавание.
zh_hans: 触摸触控板以查看识别结果。
zh_hant: 觸控觸控式軌跡板以檢視識別結果。

# gestureTest.rawTouchesNotStored
source: Raw touch paths are never written to disk.
fr: Les tracés tactiles bruts ne sont jamais écrits sur le disque.
ja: 生のタッチ軌跡はディスクに書き込まれません。
ko: 원본 터치 경로는 디스크에 기록되지 않습니다.
ru: Сырые траектории касаний на диск не записываются.
zh_hans: 原始触点轨迹不会写入磁盘。
zh_hant: 原始觸點軌跡不會寫入磁碟。

# gestureTest.trackpadMatched
source: Gesture matched
fr: Geste reconnu
ja: ジェスチャが一致しました
ko: 제스처가 일치함
ru: Жест распознан
zh_hans: 手势已匹配
zh_hant: 手勢已匹配

# gestureTest.trackpadNoMatch
source: No configured match
fr: Aucune correspondance configurée
ja: 一致する設定がありません
ko: 구성된 일치 항목 없음
ru: Нет подходящей конфигурации
zh_hans: 没有匹配的配置
zh_hant: 沒有匹配的配置

# gestureTest.trackpadConflict
source: Conflict: %d exact matches
fr: Conflit : %d correspondances exactes
ja: 競合: 完全一致が %d 件
ko: 충돌: 정확한 일치 %d개
ru: Конфликт: точных совпадений — %d
zh_hans: 冲突：存在 %d 条精确匹配
zh_hant: 衝突：存在 %d 條精確匹配

# gestureTest.trackpadCancelled
source: Gesture cancelled
fr: Geste annulé
ja: ジェスチャがキャンセルされました
ko: 제스처가 취소됨
ru: Жест отменён
zh_hans: 手势已取消
zh_hant: 手勢已取消

# gestureTest.reject.invalidFrame
source: Rejected: invalid touch frame
fr: Rejeté : trame tactile non valide
ja: 拒否: タッチフレームが無効です
ko: 거부: 터치 프레임이 올바르지 않음
ru: Отклонено: недопустимый кадр касаний
zh_hans: 拒绝：触点帧无效
zh_hant: 拒絕：觸點幀無效

# gestureTest.reject.interrupted
source: Rejected: touch sequence was interrupted
fr: Rejeté : la séquence tactile a été interrompue
ja: 拒否: タッチシーケンスが中断されました
ko: 거부: 터치 시퀀스가 중단됨
ru: Отклонено: последовательность касаний прервана
zh_hans: 拒绝：触控序列被中断
zh_hant: 拒絕：觸控序列被中斷

# gestureTest.reject.contactSetChanged
source: Rejected: finger identity changed
fr: Rejeté : l’identité des doigts a changé
ja: 拒否: 指の組み合わせが変わりました
ko: 거부: 손가락 구성이 변경됨
ru: Отклонено: набор пальцев изменился
zh_hans: 拒绝：手指集合发生变化
zh_hant: 拒絕：手指集合發生變化

# gestureTest.reject.landingSpreadExceeded
source: Rejected: fingers landed too far apart in time
fr: Rejeté : les doigts se sont posés trop loin dans le temps
ja: 拒否: 指が着く時間の差が大きすぎます
ko: 거부: 손가락이 너무 다른 시각에 닿음
ru: Отклонено: пальцы коснулись слишком в разное время
zh_hans: 拒绝：多指落下时间差过大
zh_hant: 拒絕：多指落下時間差過大

# gestureTest.reject.formingTimedOut
source: Rejected: contact group did not stabilize
fr: Rejeté : le groupe de contacts ne s’est pas stabilisé
ja: 拒否: 接触グループが安定しませんでした
ko: 거부: 접촉 그룹이 안정되지 않음
ru: Отклонено: группа касаний не стабилизировалась
zh_hans: 拒绝：触点组未及时稳定
zh_hant: 拒絕：觸點組未及時穩定

# gestureTest.reject.releaseTimedOut
source: Rejected: fingers lifted too far apart
fr: Rejeté : les doigts se sont levés trop loin dans le temps
ja: 拒否: 指を離す時間の差が大きすぎます
ko: 거부: 손가락을 너무 따로 뗌
ru: Отклонено: пальцы оторвались слишком в разное время
zh_hans: 拒绝：多指抬起时间差过大
zh_hant: 拒絕：多指抬起時間差過大

# gestureTest.reject.durationExceeded
source: Rejected: gesture exceeded two seconds
fr: Rejeté : le geste a dépassé deux secondes
ja: 拒否: ジェスチャが2秒を超えました
ko: 거부: 제스처가 2초를 초과함
ru: Отклонено: жест длился дольше двух секунд
zh_hans: 拒绝：手势超过两秒
zh_hant: 拒絕：手勢超過兩秒

# gestureTest.reject.unsupported
source: Rejected: unsupported or below threshold
fr: Rejeté : non pris en charge ou sous le seuil
ja: 拒否: 未対応、またはしきい値未満です
ko: 거부: 지원되지 않거나 임계값 미만
ru: Отклонено: не поддерживается или ниже порога
zh_hans: 拒绝：不支持或未达到阈值
zh_hant: 拒絕：不支援或未達到閾值

# gestureTest.reject.ambiguous
source: Rejected: dominant transform was ambiguous
fr: Rejeté : la transformation dominante était ambiguë
ja: 拒否: 主となる変形が曖昧です
ko: 거부: 주된 변형이 모호함
ru: Отклонено: ведущее преобразование неоднозначно
zh_hans: 拒绝：主导变形不明确
zh_hant: 拒絕：主導變形不明確

# config.failure.unsupportedVersion
source: Unsupported gesture configuration version %d.
fr: Version de configuration de gestes %d non prise en charge.
ja: サポートされていないジェスチャ設定バージョン %d です。
ko: 지원하지 않는 제스처 구성 버전 %d입니다.
ru: Неподдерживаемая версия конфигурации жестов %d.
zh_hans: 不支持手势配置版本 %d。
zh_hant: 不支援手勢配置版本 %d。

# config.failure.decode
source: Could not decode the gesture configuration: %@
fr: Impossible de décoder la configuration des gestes : %@
ja: ジェスチャ設定を解析できません: %@
ko: 제스처 구성을 디코드할 수 없습니다: %@
ru: Не удалось разобрать конфигурацию жестов: %@
zh_hans: 无法解析手势配置：%@
zh_hant: 無法解析手勢配置：%@

# config.failure.backup
source: Could not preserve the v1 configuration backup: %@
fr: Impossible de conserver la sauvegarde de configuration v1 : %@
ja: v1設定のバックアップを保持できません: %@
ko: v1 구성 백업을 보존할 수 없습니다: %@
ru: Не удалось сохранить резервную копию конфигурации v1: %@
zh_hans: 无法保留 v1 配置备份：%@
zh_hant: 無法保留 v1 配置備份：%@

# config.failure.persistence
source: Could not save the gesture configuration: %@
fr: Impossible d’enregistrer la configuration des gestes : %@
ja: ジェスチャ設定を保存できません: %@
ko: 제스처 구성을 저장할 수 없습니다: %@
ru: Не удалось сохранить конфигурацию жестов: %@
zh_hans: 无法保存手势配置：%@
zh_hant: 無法儲存手勢配置：%@

# config.failure.duplicateID
source: The gesture configuration contains duplicate profile ID %@.
fr: La configuration des gestes contient un ID de profil en double %@.
ja: ジェスチャ設定に重複したプロファイルID %@ があります。
ko: 제스처 구성에 중복된 프로필 ID %@가 있습니다.
ru: В конфигурации жестов повторяется ID профиля %@.
zh_hans: 手势配置包含重复的配置 ID %@。
zh_hant: 手勢配置包含重複的配置 ID %@。

# config.failure.drawnPathTooShort
source: Drawn gesture %@ must contain at least two points.
fr: Le geste dessiné %@ doit contenir au moins deux points.
ja: 描画ジェスチャ %@ には少なくとも2つの点が必要です。
ko: 그리기 제스처 %@에는 점이 두 개 이상 있어야 합니다.
ru: Рисованный жест %@ должен содержать не менее двух точек.
zh_hans: 绘制手势 %@ 必须至少包含两个点。
zh_hant: 繪製手勢 %@ 必須至少包含兩個點。

# config.failure.nonFinitePoint
source: Drawn gesture %@ contains a non-finite point.
fr: Le geste dessiné %@ contient un point non fini.
ja: 描画ジェスチャ %@ に無効な数値の点が含まれています。
ko: 그리기 제스처 %@에 유한하지 않은 점이 있습니다.
ru: Рисованный жест %@ содержит точку с недопустимым числом.
zh_hans: 绘制手势 %@ 包含无效数值点。
zh_hant: 繪製手勢 %@ 包含無效數值點。

# config.failure.emptyExport
source: No gestures are selected for export.
fr: Aucun geste n’est sélectionné pour l’exportation.
ja: 書き出すジェスチャが選択されていません。
ko: 내보낼 제스처가 선택되지 않았습니다.
ru: Не выбраны жесты для экспорта.
zh_hans: 没有选择要导出的手势。
zh_hant: 沒有選擇要匯出的手勢。

# config.failure.emptyImport
source: No gestures were found in this file.
fr: Aucun geste n’a été trouvé dans ce fichier.
ja: このファイルにはジェスチャが見つかりません。
ko: 이 파일에서 제스처를 찾지 못했습니다.
ru: В этом файле нет жестов.
zh_hans: 此文件中没有手势。
zh_hant: 此檔案中沒有手勢。

# common.continue
source: Continue
fr: Continuer
ja: 続ける
ko: 계속
ru: Продолжить
zh_hans: 继续
zh_hant: 繼續

# config.failure.recoveryRequired
source: The existing configuration must be recovered before gestures can be changed.
fr: La configuration existante doit être récupérée avant de pouvoir modifier les gestes.
ja: ジェスチャを変更する前に、既存の設定を復元する必要があります。
ko: 제스처를 변경하려면 먼저 기존 구성을 복구해야 합니다.
ru: Сначала нужно восстановить существующую конфигурацию, чтобы изменять жесты.
zh_hans: 必须先恢复现有配置，才能修改手势。
zh_hant: 必須先恢復現有配置，才能修改手勢。

# config.failure.recoveryBackup
source: Could not preserve the recovery copy: %@
fr: Impossible de conserver la copie de récupération : %@
ja: 復元用コピーを保持できません: %@
ko: 복구 복사본을 보존할 수 없습니다: %@
ru: Не удалось сохранить копию для восстановления: %@
zh_hans: 无法保留恢复副本：%@
zh_hant: 無法保留恢復副本：%@

# gestures.configRecovery.title
source: Gesture configuration needs recovery
fr: La configuration des gestes doit être récupérée
ja: ジェスチャ設定の復元が必要です
ko: 제스처 구성을 복구해야 합니다
ru: Конфигурация жестов требует восстановления
zh_hans: 手势配置需要恢复
zh_hant: 手勢配置需要恢復

# gestures.configRecovery.confirmTitle
source: Back Up and Restore Defaults?
fr: Sauvegarder et restaurer les valeurs par défaut ?
ja: バックアップしてデフォルトに戻しますか？
ko: 원본을 백업하고 기본값으로 복원할까요?
ru: Создать резервную копию и восстановить стандартные настройки?
zh_hans: 备份原文件并恢复默认配置？
zh_hant: 備份原檔案並恢復預設配置？

# gestures.configRecovery.confirmMessage
source: StrokeMouse will preserve the existing file byte-for-byte in a new recovery backup, then replace it with the seven default mouse gestures.
fr: StrokeMouse conservera le fichier existant octet par octet dans une nouvelle sauvegarde de récupération, puis le remplacera par les sept gestes de souris par défaut.
ja: StrokeMouseは既存ファイルをバイト単位で新しい復元バックアップに保存してから、7つのデフォルトマウスジェスチャで置き換えます。
ko: StrokeMouse는 기존 파일을 바이트 단위로 새 복구 백업에 보존한 다음 기본 마우스 제스처 7개로 교체합니다.
ru: StrokeMouse сохранит существующий файл побайтово в новой резервной копии восстановления, затем заменит его семью жестами рисования мышью по умолчанию.
zh_hans: StrokeMouse 会先将现有文件原样保存为新的恢复备份，再用七条默认鼠标手势替换它。
zh_hant: StrokeMouse 會先將現有檔案原樣儲存為新的恢復備份，再用七條預設滑鼠手勢替換它。

# gestures.configRecovery.restore
source: Back Up and Restore
fr: Sauvegarder et restaurer
ja: バックアップして復元
ko: 백업 후 복원
ru: Создать копию и восстановить
zh_hans: 备份并恢复
zh_hant: 備份並恢復

# gestures.configRecovery.reveal
source: Reveal Original
fr: Afficher l’original
ja: 元のファイルを表示
ko: 원본 보기
ru: Показать исходный файл
zh_hans: 显示原文件
zh_hant: 顯示原檔案

# gestures.configRecovery.restoredTitle
source: Configuration Restored
fr: Configuration restaurée
ja: 設定を復元しました
ko: 구성이 복원됨
ru: Конфигурация восстановлена
zh_hans: 配置已恢复
zh_hant: 配置已恢復

# gestures.configRecovery.restoredMessage
source: Defaults were restored. The original bytes are preserved at: %@
fr: Les valeurs par défaut ont été restaurées. Les octets d’origine sont conservés ici : %@
ja: デフォルト設定を復元しました。元のファイルは次の場所に保存されています: %@
ko: 기본값이 복원되었으며, 원본 바이트는 다음에 보존되어 있습니다: %@
ru: Настройки по умолчанию восстановлены. Исходные байты сохранены здесь: %@
zh_hans: 已恢复默认配置，原文件字节已保存在： %@
zh_hant: 已恢復預設配置，原檔案位元組已儲存在： %@

# gestures.configRecovery.notRequired
source: The configuration no longer requires recovery.
fr: La configuration n’a plus besoin d’être récupérée.
ja: この設定は、もう復元の必要はありません。
ko: 구성이 더 이상 복구가 필요하지 않습니다.
ru: Конфигурация больше не требует восстановления.
zh_hans: 当前配置已不需要恢复。
zh_hant: 當前配置已不需要恢復。

# gestures.configRecovery.failedTitle
source: Could Not Recover Configuration
fr: Impossible de récupérer la configuration
ja: 設定を復元できませんでした
ko: 구성을 복구할 수 없음
ru: Не удалось восстановить конфигурацию
zh_hans: 无法恢复配置
zh_hant: 無法恢復配置

# gestures.importPrivilegedTitle
source: Import High-Privilege Actions?
fr: Importer des actions à privilèges élevés ?
ja: 高権限のアクションを読み込みますか？
ko: 높은 권한 동작을 가져올까요?
ru: Импортировать действия с повышенными привилегиями?
zh_hans: 导入高权限动作？
zh_hant: 匯入高許可權動作？

# gestures.importPrivilegedMessage
source: %d imported gestures contain shell commands or AppleScript and can run with your user permissions when triggered. Review the named gestures before continuing.
fr: %d geste(s) importé(s) contiennent des commandes Shell ou de l’AppleScript et peuvent s’exécuter avec vos permissions utilisateur une fois déclenchés. Vérifiez les gestes nommés avant de continuer.
ja: 読み込む%d件のジェスチャにShellコマンドまたはAppleScriptが含まれており、トリガー時にユーザ権限で実行されます。続行する前に、次のジェスチャ名を確認してください。
ko: 가져올 제스처 %d개에 Shell 명령어나 AppleScript가 포함되어 있으며, 트리거되면 사용자 권한으로 실행될 수 있으니 계속하기 전에 해당 제스처 이름을 확인하세요.
ru: %d импортируемых жестов содержат команды Shell или AppleScript и при срабатывании могут выполняться с вашими правами пользователя. Перед продолжением проверьте указанные имена жестов.
zh_hans: 有 %d 条待导入手势包含 Shell 命令或 AppleScript，触发后会以你的用户权限运行；继续前请核对以下手势名称。
zh_hant: 有 %d 條待匯入手勢包含 Shell 命令或 AppleScript，觸發後會以你的使用者許可權執行；繼續前請核對以下手勢名稱。

# gestures.importPrivilegedConfirm
source: Import Anyway
fr: Importer quand même
ja: それでも読み込む
ko: 그래도 가져오기
ru: Импортировать всё равно
zh_hans: 仍然导入
zh_hant: 仍然匯入

# gestureTest.trackpadConsentMessage
source: Trackpad diagnostics temporarily starts the experimental private MultitouchSupport channel. This does not record permanent consent, enable profiles, or execute actions.
fr: Le diagnostic du trackpad démarre temporairement le canal expérimental privé MultitouchSupport. Cela n’enregistre pas de consentement permanent, n’active pas de profils et n’exécute pas d’actions.
ja: トラックパッド診断は、実験的な非公開MultitouchSupportチャネルを一時的に開始します。永続的な同意の記録、プロファイルの有効化、アクションの実行は行いません。
ko: 트랙패드 진단은 실험적인 비공개 MultitouchSupport 채널을 일시적으로 시작하며, 영구 동의를 기록하거나 구성을 활성화하거나 동작을 실행하지 않습니다.
ru: Диагностика трекпада временно запускает экспериментальный непубличный канал MultitouchSupport. Постоянное согласие не записывается, профили не включаются и действия не выполняются.
zh_hans: 触控板诊断会临时启动实验性的私有 MultitouchSupport 通道，但不会记录永久同意、启用配置或执行动作。
zh_hant: 觸控式軌跡板診斷會臨時啟動實驗性的私有 MultitouchSupport 通道，但不會記錄永久同意、啟用配置或執行動作。

# gestureTest.trackpadDisabled
source: Touch gestures are off. Turn on the Touch Gestures switch to inspect touch recognition.
fr: Les gestes tactiles sont désactivés. Activez l’interrupteur Gestes tactiles pour examiner la reconnaissance tactile.
ja: タッチジェスチャはオフです。タッチ認識を確認するには、「タッチジェスチャ」スイッチをオンにしてください。
ko: 터치 제스처가 꺼져 있으니, 터치 인식을 확인하려면 터치 제스처 스위치를 켜세요.
ru: Сенсорные жесты выключены. Включите переключатель «Сенсорные жесты», чтобы проверить распознавание касаний.
zh_hans: 触控手势已关闭，请先开启“触控手势”开关再检查触控识别。
zh_hant: 觸控手勢已關閉，請先開啟“觸控手勢”開關再檢查觸控識別。

# general.feedback
source: Feedback
fr: Retours
ja: フィードバック
ko: 피드백
ru: Отклик
zh_hans: 反馈
zh_hant: 反饋

# general.showMatchToast
source: Show Successful Match Toast
fr: Afficher la notification de correspondance
ja: 一致成功の通知を表示
ko: 일치 성공 토스트 보기
ru: Показывать уведомление об успешном совпадении
zh_hans: 显示成功匹配提示
zh_hant: 顯示成功匹配提示

# general.showMissToast
source: Show Unrecognized Gesture Toast
fr: Afficher la notification de geste non reconnu
ja: 未認識ジェスチャの通知を表示
ko: 인식되지 않은 제스처 토스트 보기
ru: Показывать уведомление о нераспознанном жесте
zh_hans: 显示未识别手势提示
zh_hant: 顯示未識別手勢提示

# general.feedbackHint
source: Toasts appear after a gesture ends. Action errors always show, even when these are off.
fr: Les notifications apparaissent à la fin d’un geste ; les erreurs d’action s’affichent toujours, même si ces options sont désactivées.
ja: 通知はジェスチャ終了後に表示されます。これらをオフにしても、アクションのエラーは常に表示されます。
ko: 토스트는 제스처가 끝난 뒤 나타나며, 이 옵션이 꺼져 있어도 동작 오류는 항상 표시됩니다.
ru: Уведомления появляются после завершения жеста. Ошибки выполнения действий всегда отображаются, даже если эти параметры выключены.
zh_hans: 提示在手势结束后显示；即使关闭以上选项，动作执行失败仍会提示。
zh_hant: 提示在手勢結束後顯示；即使關閉以上選項，動作執行失敗仍會提示。

# general.showLiveMismatchFeedback
source: Real-time Unrecognized Feedback
fr: Retour en temps réel si non reconnu
ja: リアルタイムの未認識フィードバック
ko: 실시간 미인식 피드백
ru: Мгновенный отклик о нераспознавании
zh_hans: 实时未识别反馈
zh_hant: 實時未識別反饋

# general.showLiveMismatchFeedbackHint
source: While drawing, recolor the trail when the path is unlikely to match any gesture; this is visual only and does not change recognition on release.
fr: Pendant le dessin, le tracé change de couleur s’il a peu de chances de correspondre à un geste ; cela reste visuel et ne modifie pas la reconnaissance au relâchement.
ja: 描画中、どのジェスチャにも一致しそうにない軌跡は色を変えます。見た目のヒントのみで、離したときの認識結果は変わりません。
ko: 그리는 동안 경로가 어떤 제스처와도 일치하기 어려우면 궤적 색이 바뀌며, 시각적 표시일 뿐 놓을 때의 인식은 바뀌지 않습니다.
ru: Во время рисования меняет цвет следа, если траектория вряд ли совпадёт с каким-либо жестом; это только визуальная подсказка и не влияет на распознавание при отпускании.
zh_hans: 绘制过程中，当轨迹已不太可能匹配任何手势时改变颜色；仅视觉提示，不影响松手时的识别结果。
zh_hant: 繪製過程中，當軌跡已不太可能匹配任何手勢時改變顏色；僅視覺提示，不影響鬆手時的識別結果。

# general.mismatchLineColor
source: Unrecognized Trail Color
fr: Couleur du tracé non reconnu
ja: 未認識の軌跡の色
ko: 미인식 궤적 색상
ru: Цвет нераспознанной траектории
zh_hans: 未识别轨迹颜色
zh_hant: 未識別軌跡顏色

# tab.sync
source: Sync
fr: Synchronisation
ja: 同期
ko: 동기화
ru: Синхронизация
zh_hans: 同步
zh_hant: 同步

# sync.provider
source: Provider
fr: Service
ja: プロバイダ
ko: 제공자
ru: Служба
zh_hans: 服务方式
zh_hant: 服務方式

# sync.connection
source: Connection
fr: Connexion
ja: 接続
ko: 연결
ru: Подключение
zh_hans: 连接
zh_hant: 連線

# sync.gist.id
source: Existing Gist URL or ID
fr: URL ou ID de Gist existant
ja: 既存のGist URLまたはID
ko: 기존 Gist URL 또는 ID
ru: URL или ID существующего Gist
zh_hans: 已有 Gist URL 或 ID
zh_hant: 已有 Gist URL 或 ID

# sync.gist.idPrompt
source: Leave blank to create a new secret Gist
fr: Laissez vide pour créer un nouveau Gist secret
ja: 空欄のままにすると新しいsecret Gistを作成します
ko: 비워 두면 새 비밀 Gist를 만듭니다
ru: Оставьте пустым, чтобы создать новый секретный Gist
zh_hans: 留空以创建新的 secret Gist
zh_hant: 留空以建立新的 secret Gist

# sync.gist.token
source: Personal access token
fr: Jeton d’accès personnel
ja: 個人用アクセストークン
ko: 개인용 액세스 토큰
ru: Персональный токен доступа
zh_hans: 个人访问令牌
zh_hant: 個人訪問令牌

# sync.gist.help
source: The token needs write access to Gists. A secret Gist is unlisted, but its plaintext remains visible to GitHub.
fr: Le jeton doit pouvoir écrire dans les Gists. Un Gist secret n’est pas listé publiquement, mais son contenu en clair reste visible pour GitHub.
ja: トークンにはGistの書き込み権限が必要です。secret Gistは一覧に公開されませんが、平文の内容はGitHubから見えます。
ko: 토큰에 Gist 쓰기 권한이 필요하며, 비밀 Gist는 목록에 없지만 평문은 여전히 GitHub에 보입니다.
ru: Токену нужны права на запись в Gists. Секретный Gist не отображается в списках, но его открытый текст по-прежнему виден GitHub.
zh_hans: 令牌需要 Gists 写入权限；secret Gist 只是不公开列出，明文内容仍对 GitHub 可见。
zh_hant: 令牌需要 Gists 寫入許可權；secret Gist 只是不公開列出，明文內容仍對 GitHub 可見。

# sync.gist.visibilityConfirmation
source: I have checked the existing Gist's visibility and understand it may be public
fr: J’ai vérifié la visibilité du Gist existant et je comprends qu’il peut être public
ja: 既存Gistの公開範囲を確認し、公開である可能性があることを理解しています
ko: 기존 Gist의 공개 여부를 확인했으며 공개일 수 있음을 이해합니다
ru: Я проверил видимость существующего Gist и понимаю, что он может быть общедоступным
zh_hans: 我已检查现有 Gist 的可见性，并了解它可能是公开的
zh_hant: 我已檢查現有 Gist 的可見性，並瞭解它可能是公開的

# sync.webdav.url
source: WebDAV user directory URL
fr: URL du répertoire utilisateur WebDAV
ja: WebDAVユーザディレクトリのURL
ko: WebDAV 사용자 디렉토리 URL
ru: URL пользовательского каталога WebDAV
zh_hans: WebDAV 用户目录 URL
zh_hant: WebDAV 使用者目錄 URL

# sync.webdav.username
source: Username
fr: Nom d’utilisateur
ja: ユーザ名
ko: 사용자 이름
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 使用者名稱

# sync.webdav.password
source: Password or app password
fr: Mot de passe ou mot de passe d’app
ja: パスワードまたはアプリパスワード
ko: 암호 또는 앱 암호
ru: Пароль или пароль приложения
zh_hans: 密码或应用专用密码
zh_hant: 密碼或應用專用密碼

# sync.webdav.help
source: Backups are stored under a fixed StrokeMouse folder. Basic and Digest authentication are supported.
fr: Les sauvegardes sont stockées dans un dossier StrokeMouse fixe. L’authentification Basic et Digest est prise en charge.
ja: バックアップは固定のStrokeMouseフォルダに保存されます。Basic認証とDigest認証に対応しています。
ko: 백업은 고정된 StrokeMouse 폴더에 저장되며, Basic 및 Digest 인증을 지원합니다.
ru: Резервные копии сохраняются в фиксированной папке StrokeMouse. Поддерживается аутентификация Basic и Digest.
zh_hans: 备份会保存到固定的 StrokeMouse 目录；支持 Basic 与 Digest 认证。
zh_hant: 備份會儲存到固定的 StrokeMouse 目錄；支援 Basic 與 Digest 認證。
